; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-40)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 ball39 ball40 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(ball ball39)
(ball ball40)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room4)
(at ball31 room4)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
(at ball35 room4)
(at ball36 room4)
(at ball37 room4)
(at ball38 room4)
(at ball39 room4)
(at ball40 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at ball33 roomb)
(at ball34 roomb)
(at ball35 roomb)
(at ball36 roomb)
(at ball37 roomb)
(at ball38 roomb)
(at ball39 roomb)
(at ball40 roomb)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 11 of 40
2. (pick ball8 rooma right)
   deleted: (at ball8 rooma) (free right)
   added: (carry ball8 right)
   goals met: 11 of 40
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 40
4. (drop ball8 roomb right)
   deleted: (carry ball8 right)
   added: (at ball8 roomb) (free right)
   goals met: 12 of 40
5. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 13 of 40
6. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 13 of 40
7. (pick ball40 room4 left)
   deleted: (at ball40 room4) (free left)
   added: (carry ball40 left)
   goals met: 13 of 40
8. (pick ball39 room4 right)
   deleted: (at ball39 room4) (free right)
   added: (carry ball39 right)
   goals met: 13 of 40
9. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 13 of 40
10. (drop ball39 roomb right)
   deleted: (carry ball39 right)
   added: (at ball39 roomb) (free right)
   goals met: 14 of 40
11. (drop ball40 roomb left)
   deleted: (carry ball40 left)
   added: (at ball40 roomb) (free left)
   goals met: 15 of 40
12. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 15 of 40
13. (pick ball38 room4 left)
   deleted: (at ball38 room4) (free left)
   added: (carry ball38 left)
   goals met: 15 of 40
14. (pick ball37 room4 right)
   deleted: (at ball37 room4) (free right)
   added: (carry ball37 right)
   goals met: 15 of 40
15. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 15 of 40
16. (drop ball37 roomb right)
   deleted: (carry ball37 right)
   added: (at ball37 roomb) (free right)
   goals met: 16 of 40
17. (drop ball38 roomb left)
   deleted: (carry ball38 left)
   added: (at ball38 roomb) (free left)
   goals met: 17 of 40
18. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 17 of 40
19. (pick ball36 room4 left)
   deleted: (at ball36 room4) (free left)
   added: (carry ball36 left)
   goals met: 17 of 40
20. (pick ball35 room4 right)
   deleted: (at ball35 room4) (free right)
   added: (carry ball35 right)
   goals met: 17 of 40
21. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 17 of 40
22. (drop ball35 roomb right)
   deleted: (carry ball35 right)
   added: (at ball35 roomb) (free right)
   goals met: 18 of 40
23. (drop ball36 roomb left)
   deleted: (carry ball36 left)
   added: (at ball36 roomb) (free left)
   goals met: 19 of 40
24. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 19 of 40
25. (pick ball34 room4 left)
   deleted: (at ball34 room4) (free left)
   added: (carry ball34 left)
   goals met: 19 of 40
26. (pick ball33 room4 right)
   deleted: (at ball33 room4) (free right)
   added: (carry ball33 right)
   goals met: 19 of 40
27. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 19 of 40
28. (drop ball33 roomb right)
   deleted: (carry ball33 right)
   added: (at ball33 roomb) (free right)
   goals met: 20 of 40
29. (drop ball34 roomb left)
   deleted: (carry ball34 left)
   added: (at ball34 roomb) (free left)
   goals met: 21 of 40
30. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 21 of 40
31. (pick ball32 room4 left)
   deleted: (at ball32 room4) (free left)
   added: (carry ball32 left)
   goals met: 21 of 40
32. (pick ball31 room4 right)
   deleted: (at ball31 room4) (free right)
   added: (carry ball31 right)
   goals met: 21 of 40
33. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 21 of 40
34. (drop ball31 roomb right)
   deleted: (carry ball31 right)
   added: (at ball31 roomb) (free right)
   goals met: 22 of 40
35. (drop ball32 roomb left)
   deleted: (carry ball32 left)
   added: (at ball32 roomb) (free left)
   goals met: 23 of 40
36. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 23 of 40
37. (pick ball30 room4 left)
   deleted: (at ball30 room4) (free left)
   added: (carry ball30 left)
   goals met: 23 of 40
38. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 23 of 40
39. (drop ball30 roomb left)
   deleted: (carry ball30 left)
   added: (at ball30 roomb) (free left)
   goals met: 24 of 40
40. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 24 of 40
41. (pick ball29 room3 left)
   deleted: (at ball29 room3) (free left)
   added: (carry ball29 left)
   goals met: 24 of 40
42. (pick ball28 room3 right)
   deleted: (at ball28 room3) (free right)
   added: (carry ball28 right)
   goals met: 24 of 40
43. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 24 of 40
44. (drop ball28 roomb right)
   deleted: (carry ball28 right)
   added: (at ball28 roomb) (free right)
   goals met: 25 of 40
45. (drop ball29 roomb left)
   deleted: (carry ball29 left)
   added: (at ball29 roomb) (free left)
   goals met: 26 of 40
46. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 26 of 40
47. (pick ball27 room3 left)
   deleted: (at ball27 room3) (free left)
   added: (carry ball27 left)
   goals met: 26 of 40
48. (pick ball26 room3 right)
   deleted: (at ball26 room3) (free right)
   added: (carry ball26 right)
   goals met: 26 of 40
49. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 26 of 40
50. (drop ball26 roomb right)
   deleted: (carry ball26 right)
   added: (at ball26 roomb) (free right)
   goals met: 27 of 40
51. (drop ball27 roomb left)
   deleted: (carry ball27 left)
   added: (at ball27 roomb) (free left)
   goals met: 28 of 40
52. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 28 of 40
53. (pick ball25 room3 left)
   deleted: (at ball25 room3) (free left)
   added: (carry ball25 left)
   goals met: 28 of 40
54. (pick ball24 room3 right)
   deleted: (at ball24 room3) (free right)
   added: (carry ball24 right)
   goals met: 28 of 40
55. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 28 of 40
56. (drop ball24 roomb right)
   deleted: (carry ball24 right)
   added: (at ball24 roomb) (free right)
   goals met: 29 of 40
57. (drop ball25 roomb left)
   deleted: (carry ball25 left)
   added: (at ball25 roomb) (free left)
   goals met: 30 of 40
58. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 30 of 40
59. (pick ball23 room3 left)
   deleted: (at ball23 room3) (free left)
   added: (carry ball23 left)
   goals met: 30 of 40
60. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 30 of 40
61. (drop ball23 roomb left)
   deleted: (carry ball23 left)
   added: (at ball23 roomb) (free left)
   goals met: 31 of 40
62. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 31 of 40
63. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 31 of 40
64. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 31 of 40
65. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 31 of 40
66. (drop ball6 roomb right)
   deleted: (carry ball6 right)
   added: (at ball6 roomb) (free right)
   goals met: 32 of 40
67. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 33 of 40
68. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 33 of 40
69. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 33 of 40
70. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 33 of 40
71. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 33 of 40
72. (drop ball4 roomb right)
   deleted: (carry ball4 right)
   added: (at ball4 roomb) (free right)
   goals met: 34 of 40
73. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 35 of 40
74. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 35 of 40
75. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 35 of 40
76. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 35 of 40
77. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 35 of 40
78. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at ball2 roomb) (free right)
   goals met: 36 of 40
79. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 37 of 40
80. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 37 of 40
81. (pick ball11 rooma left)
   deleted: (at ball11 rooma) (free left)
   added: (carry ball11 left)
   goals met: 37 of 40
82. (pick ball10 rooma right)
   deleted: (at ball10 rooma) (free right)
   added: (carry ball10 right)
   goals met: 37 of 40
83. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 37 of 40
84. (drop ball10 roomb right)
   deleted: (carry ball10 right)
   added: (at ball10 roomb) (free right)
   goals met: 38 of 40
85. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 39 of 40
86. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 39 of 40
87. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 39 of 40
88. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 39 of 40
89. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at ball1 roomb) (free left)
   goals met: 40 of 40
